In [187]:
import numpy as np

In [188]:
import pandas as pd

In [12]:
lables = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [13]:
arr

array([10, 20, 30])

In [14]:
lables

['a', 'b', 'c']

In [15]:
my_data
d

{'a': 10, 'b': 20, 'c': 30}

In [16]:
my_data

[10, 20, 30]

In [17]:
ser = pd.Series(my_data)

In [18]:
ser

0    10
1    20
2    30
dtype: int64

In [19]:
ser = pd.Series(my_data,lables)

In [20]:
ser

a    10
b    20
c    30
dtype: int64

In [21]:
pd.Series(lables,arr)

10    a
20    b
30    c
dtype: object

In [22]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [23]:
names = ['shivani','raksha','vins','boomi']
num = [130,131,114,124]

In [24]:
ser1 = pd.Series(num,names)

In [25]:
ser1

shivani    130
raksha     131
vins       114
boomi      124
dtype: int64

In [26]:
ser1[3]

124

In [27]:
ser2 = pd.Series([130,131,230,114],['shivani','raksha','srinidhi','vins'])

In [28]:
ser2

shivani     130
raksha      131
srinidhi    230
vins        114
dtype: int64

In [29]:
#If we add both the series then the element not having same functionalities will be given a NAN as value
ser1 + ser2

boomi         NaN
raksha      262.0
shivani     260.0
srinidhi      NaN
vins        228.0
dtype: float64

In [30]:
from numpy.random import randn

In [46]:
#seed is used to get the same random numbers
np.random.seed(101)

In [32]:
df = pd.DataFrame(randn(5,5),['V','W','X','Y','Z'],['A','B','C','D','E'])

In [33]:
df

          A         B         C         D         E
V  2.706850  0.628133  0.907969  0.503826  0.651118
W -0.319318 -0.848077  0.605965 -2.018168  0.740122
X  0.528813 -0.589001  0.188695 -0.758872 -0.933237
Y  0.955057  0.190794  1.978757  2.605967  0.683509
Z  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [34]:
df['B']

V    0.628133
W   -0.848077
X   -0.589001
Y    0.190794
Z    1.693723
Name: B, dtype: float64

In [35]:
df['new'] = df['C'] + df['D']
df

          A         B         C         D         E       new
V  2.706850  0.628133  0.907969  0.503826  0.651118  1.411795
W -0.319318 -0.848077  0.605965 -2.018168  0.740122 -1.412203
X  0.528813 -0.589001  0.188695 -0.758872 -0.933237 -0.570177
Y  0.955057  0.190794  1.978757  2.605967  0.683509  4.584725
Z  0.302665  1.693723 -1.706086 -1.159119 -0.134841 -2.865205

In [36]:
df.drop('new', axis = 1, inplace = True)

In [37]:
df

          A         B         C         D         E
V  2.706850  0.628133  0.907969  0.503826  0.651118
W -0.319318 -0.848077  0.605965 -2.018168  0.740122
X  0.528813 -0.589001  0.188695 -0.758872 -0.933237
Y  0.955057  0.190794  1.978757  2.605967  0.683509
Z  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [38]:
df.shape

(5, 5)

In [39]:
#two ways of selecting rows one by calling the names and other is giving the indexes of thet particular row.
df.loc['W']

A   -0.319318
B   -0.848077
C    0.605965
D   -2.018168
E    0.740122
Name: W, dtype: float64

In [40]:
df.iloc[2]

A    0.528813
B   -0.589001
C    0.188695
D   -0.758872
E   -0.933237
Name: X, dtype: float64

In [41]:
df.iloc[1]

A   -0.319318
B   -0.848077
C    0.605965
D   -2.018168
E    0.740122
Name: W, dtype: float64

In [42]:
df.loc['W','B']

-0.8480769834036315

In [43]:
df.iloc[0]

A    2.706850
B    0.628133
C    0.907969
D    0.503826
E    0.651118
Name: V, dtype: float64

In [44]:
df.loc['Y','C']

1.9787573241128278

In [45]:
df.loc[['Y','Z'],['C','D']]

          C         D
Y  1.978757  2.605967
Z -1.706086 -1.159119

In [47]:
#conditional selection
df > 0

       A      B      C      D      E
V   True   True   True   True   True
W  False  False   True  False   True
X   True  False   True  False  False
Y   True   True   True   True   True
Z   True   True  False  False  False

In [48]:
booldf = df > 0

In [50]:
df[booldf]

          A         B         C         D         E
V  2.706850  0.628133  0.907969  0.503826  0.651118
W       NaN       NaN  0.605965       NaN  0.740122
X  0.528813       NaN  0.188695       NaN       NaN
Y  0.955057  0.190794  1.978757  2.605967  0.683509
Z  0.302665  1.693723       NaN       NaN       NaN

In [51]:
df[df > 0]

          A         B         C         D         E
V  2.706850  0.628133  0.907969  0.503826  0.651118
W       NaN       NaN  0.605965       NaN  0.740122
X  0.528813       NaN  0.188695       NaN       NaN
Y  0.955057  0.190794  1.978757  2.605967  0.683509
Z  0.302665  1.693723       NaN       NaN       NaN

In [52]:
df['C'] > 0

V     True
W     True
X     True
Y     True
Z    False
Name: C, dtype: bool

In [53]:
df[df['C'] > 0]

          A         B         C         D         E
V  2.706850  0.628133  0.907969  0.503826  0.651118
W -0.319318 -0.848077  0.605965 -2.018168  0.740122
X  0.528813 -0.589001  0.188695 -0.758872 -0.933237
Y  0.955057  0.190794  1.978757  2.605967  0.683509

In [56]:
df[df['C'] > 0][['D','E']]

          D         E
V  0.503826  0.651118
W -2.018168  0.740122
X -0.758872 -0.933237
Y  2.605967  0.683509

In [65]:
df[(df['A'] > 1) | (df['C'] > 0)]

          A         B         C         D         E
V  2.706850  0.628133  0.907969  0.503826  0.651118
W -0.319318 -0.848077  0.605965 -2.018168  0.740122
X  0.528813 -0.589001  0.188695 -0.758872 -0.933237
Y  0.955057  0.190794  1.978757  2.605967  0.683509

In [66]:
df

          A         B         C         D         E
V  2.706850  0.628133  0.907969  0.503826  0.651118
W -0.319318 -0.848077  0.605965 -2.018168  0.740122
X  0.528813 -0.589001  0.188695 -0.758872 -0.933237
Y  0.955057  0.190794  1.978757  2.605967  0.683509
Z  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [72]:
df.reset_index()

   level_0 index         A         B         C         D         E
0        0     V  2.706850  0.628133  0.907969  0.503826  0.651118
1        1     W -0.319318 -0.848077  0.605965 -2.018168  0.740122
2        2     X  0.528813 -0.589001  0.188695 -0.758872 -0.933237
3        3     Y  0.955057  0.190794  1.978757  2.605967  0.683509
4        4     Z  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [73]:
df

  index         A         B         C         D         E
0     V  2.706850  0.628133  0.907969  0.503826  0.651118
1     W -0.319318 -0.848077  0.605965 -2.018168  0.740122
2     X  0.528813 -0.589001  0.188695 -0.758872 -0.933237
3     Y  0.955057  0.190794  1.978757  2.605967  0.683509
4     Z  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [74]:
new = 'MN AK GM VS SS'.split()

In [75]:
new

['MN', 'AK', 'GM', 'VS', 'SS']

In [76]:
df['items'] = new

In [77]:
df

  index         A         B         C         D         E items
0     V  2.706850  0.628133  0.907969  0.503826  0.651118    MN
1     W -0.319318 -0.848077  0.605965 -2.018168  0.740122    AK
2     X  0.528813 -0.589001  0.188695 -0.758872 -0.933237    GM
3     Y  0.955057  0.190794  1.978757  2.605967  0.683509    VS
4     Z  0.302665  1.693723 -1.706086 -1.159119 -0.134841    SS

In [80]:
df.set_index('items')

      index         A         B         C         D         E
items
MN        V  2.706850  0.628133  0.907969  0.503826  0.651118
AK        W -0.319318 -0.848077  0.605965 -2.018168  0.740122
GM        X  0.528813 -0.589001  0.188695 -0.758872 -0.933237
VS        Y  0.955057  0.190794  1.978757  2.605967  0.683509
SS        Z  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [81]:
df

  index         A         B         C         D         E items
0     V  2.706850  0.628133  0.907969  0.503826  0.651118    MN
1     W -0.319318 -0.848077  0.605965 -2.018168  0.740122    AK
2     X  0.528813 -0.589001  0.188695 -0.758872 -0.933237    GM
3     Y  0.955057  0.190794  1.978757  2.605967  0.683509    VS
4     Z  0.302665  1.693723 -1.706086 -1.159119 -0.134841    SS

In [82]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [83]:
df = pd.DataFrame(randn(6,2), hier_index,['W','Y'])

In [84]:
df

             W         Y
G1 1  2.706850  0.628133
   2  0.907969  0.503826
   3  0.651118 -0.319318
G2 1 -0.848077  0.605965
   2 -2.018168  0.740122
   3  0.528813 -0.589001

In [86]:
df.loc['G1'].iloc[1]

W    0.907969
Y    0.503826
Name: 2, dtype: float64

In [92]:
df = pd.DataFrame(randn(6,4), hier_index,['W','X','Z','Y'])

In [93]:
df

             W         X         Z         Y
G1 1  1.862864 -1.133817  0.610478  0.386030
   2  2.084019 -0.376519  0.230336  0.681209
   3  1.035125 -0.031160  1.939932 -1.005187
G2 1 -0.741790  0.187125 -0.732845 -1.382920
   2  1.482495  0.961458 -2.141212  0.992573
   3  1.192241 -1.046780  1.292765 -1.467514

In [97]:
df.loc['G1'].iloc[2]

W    1.035125
X   -0.031160
Z    1.939932
Y   -1.005187
Name: 3, dtype: float64

In [108]:
df.loc['G2'].iloc[1]['X']

0.9614581560918355

In [112]:
df.loc['G1'].iloc[2]['W']

1.0351250747739213

In [113]:
df.loc['G1'].loc[3]['W']

1.0351250747739213

In [118]:
#naming the indexes
df.index.names = ['Grp','Num']

In [119]:
df

                W         X         Z         Y
Grp Num
G1  1    1.862864 -1.133817  0.610478  0.386030
    2    2.084019 -0.376519  0.230336  0.681209
    3    1.035125 -0.031160  1.939932 -1.005187
G2  1   -0.741790  0.187125 -0.732845 -1.382920
    2    1.482495  0.961458 -2.141212  0.992573
    3    1.192241 -1.046780  1.292765 -1.467514

In [121]:
#getting the First indexes of of both g1 and g2
df.xs(1,level = 'Num')

            W         X         Z        Y
Grp
G1   1.862864 -1.133817  0.610478  0.38603
G2  -0.741790  0.187125 -0.732845 -1.38292

In [126]:
df.xs(1,level = 'Num')

            W         X         Z        Y
Grp
G1   1.862864 -1.133817  0.610478  0.38603
G2  -0.741790  0.187125 -0.732845 -1.38292

In [189]:
d = {'A':[1,2,5,8,np.nan],'B':[5,8,9,np.nan,6],'C':[np.nan,6,4,np.nan,5],'D':[2,9,5,1,5],'E':[7,np.nan,3,2,6],'F':[1,np.nan,np.nan,6,3]}

In [190]:
d

{'A': [1, 2, 5, 8, nan],
 'B': [5, 8, 9, nan, 6],
 'C': [nan, 6, 4, nan, 5],
 'D': [2, 9, 5, 1, 5],
 'E': [7, nan, 3, 2, 6],
 'F': [1, nan, nan, 6, 3]}

In [191]:
df = pd.DataFrame(d)

In [192]:
df

     A    B    C  D    E    F
0  1.0  5.0  NaN  2  7.0  1.0
1  2.0  8.0  6.0  9  NaN  NaN
2  5.0  9.0  4.0  5  3.0  NaN
3  8.0  NaN  NaN  1  2.0  6.0
4  NaN  6.0  5.0  5  6.0  3.0

In [193]:
# df.dropna(axis = 0) is for rows and axis = 1 is for columns
df.dropna(axis =1)

   D
0  2
1  9
2  5
3  1
4  5

In [194]:
df.dropna(thresh = 2)

     A    B    C  D    E    F
0  1.0  5.0  NaN  2  7.0  1.0
1  2.0  8.0  6.0  9  NaN  NaN
2  5.0  9.0  4.0  5  3.0  NaN
3  8.0  NaN  NaN  1  2.0  6.0
4  NaN  6.0  5.0  5  6.0  3.0

In [195]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    5.0
3    8.0
4    4.0
Name: A, dtype: float64

In [199]:
#This function provides the boolean value for the complete dataset to know if any null value is present or not.
df.isnull()

       A      B      C      D      E      F
0  False  False   True  False  False  False
1  False  False  False  False   True   True
2  False  False  False  False  False   True
3  False   True   True  False  False  False
4   True  False  False  False  False  False

In [201]:
#This is the same as the isnull() function
df.isna()

       A      B      C      D      E      F
0  False  False   True  False  False  False
1  False  False  False  False   True   True
2  False  False  False  False  False   True
3  False   True   True  False  False  False
4   True  False  False  False  False  False

In [204]:
#This function also gives a boolean value if any null value is present or not, but it gives results column-wise, not in tabular format.
df.isna().any()

A     True
B     True
C     True
D    False
E     True
F     True
dtype: bool

In [207]:
#This function gives the sum of the null values preset in the dataset column-wise.
df.isna().sum()

A    1
B    1
C    2
D    0
E    1
F    2
dtype: int64

In [209]:
df.isna().any().sum()

5

In [211]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [147]:
df.fillna(value = df['D'].mean())

     A    B    C  D    E    F
0  1.0  5.0  4.4  2  7.0  1.0
1  2.0  8.0  6.0  9  4.4  4.4
2  5.0  9.0  4.0  5  3.0  4.4
3  8.0  4.4  4.4  1  2.0  6.0
4  4.4  6.0  5.0  5  6.0  3.0

In [148]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [149]:
df = pd.DataFrame(data)

In [150]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [151]:
comp = df.groupby('Company')

In [152]:
comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [153]:
comp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [154]:
comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [155]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [156]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [157]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [159]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [166]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [167]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [168]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [169]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [170]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [171]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [172]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [173]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [176]:
pd.concat([df1,df2,df3],axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [177]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [178]:
pd.merge(left,right,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [179]:
pd.merge(left,right,how='outer', on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [181]:
pd.merge(left,right,how='right', on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [182]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [183]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [184]:
left.join(right, how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3